//  ====================================================================================================
//  Профессор Самоделкин решил изготовить объемную модель кубиков из спичек, используя спички для рёбер
//	кубиков. Длина ребра каждого кубика равна одной спичке. Для построения модели трех кубиков он 
//	использовал 28 спичек.
//	Какое наименьшее количество спичек нужно Самоделкину для построения модели из N кубиков?
//	Все числа в задаче не превышают 2·10^9.
//  ====================================================================================================
//  Входные данные:
//  Одно число N – количество кубиков.
//  ====================================================================================================
//  Выходные данные:
//  Одно число – количество спичек.
//  ====================================================================================================
//  Ввод: 	3
//  Вывод: 	28
//  ====================================================================================================

class MatchCube {
  constructor(number) {
    this.cubes = number;
  }
  matches() {
  	if(this.cubes >= 0 && this.cubes <= 2 * Math.pow(10 ,9)) {
		return 12 + ((this.cubes - 1) * 8);
	} else {
		console.log(`Сильно большое число!`);
	}
  }
}

(function() {
	let number = new MatchCube(parseInt(prompt(`Введите количество кубиков.`)));
	console.log(number.matches());
})();
