
//  ====================================================================================================
//  Программа считывает двузначное число и выводит через пробел каждую цифру отдельно.
//  ====================================================================================================
//  Входные данные:
//  Натуральное число из промежутка от 10 до 99 включительно.
//  ====================================================================================================
//  Выходные данные:
//  Два одноцифровых числа, разделенных пробелом.
//  ====================================================================================================
//  Ввод:   23
//  Вывод:  2 3
//  ====================================================================================================
import java.util.Scanner;

class NumberDivider {
  int number;
  NumberDivider(int x) {
  	this.number = x;
  }
  public String separate() {
  	if(this.number > 9 && this.number < 100) {
      String[] splitNumber = Integer.toString(this.number).split("");
      return splitNumber[0] + " " + splitNumber[1];
    } else {
      return "Цыфра " + this.number + " не подходит. Нужно ввести цыфру из промежутка от 10 до 99.";
    }
  }
}

public class Main {
  public static void main(String[] args) {
  	System.out.println("Введите цыфру из промежутка от 10 до 99.");
  	Scanner sc = new Scanner(System.in);
    NumberDivider number = new NumberDivider(sc.nextInt());
    System.out.println(number.separate());
  }
}
