//  ====================================================================================================
//  Вычислить количество цифр целого неотрицательного числа n.
//  ====================================================================================================
//  Входные данные:
//  Одно целое неотрицательное число n (0 ≤ n ≤ 2 ∙10^9).
//  ====================================================================================================
//  Выходные данные:
//  Количество цифр в числе n.
//  ====================================================================================================
//  Ввод: 	12343
//  Вывод: 	5
//  ====================================================================================================

class NumberLength {
  constructor(number) {
    this.number = number;
  }
  len() {
    if(this.number >= 0 && this.number <= 2 * Math.pow(10 ,9)) {
      let number = this.number.toString().split("");
      return number.length;
    } else {
      console.log(`Число ${this.number} не подходит. Нужно ввести целое неотрицательное число.`);
    }
  }
}

(function() {
  let number = new NumberLength(parseInt(prompt(`Введите целое неотрицательное число.`)));
  console.log(number.len());
})();
